app/controllers/checkpoints_controller.rb

   def show
      @checkpointslong = Checkpoint.order(:walk_type, :number).first(21)
      @checkpointsshort = Checkpoint.order(:walk_type, :number).last(12)
---
SELECT "checkpoints".* FROM "checkpoints" ORDER BY "checkpoints"."walk_type" ASC, "checkpoints"."number" ASC LIMIT $1  [["LIMIT", 21]]
SELECT "checkpoints".* FROM "checkpoints" ORDER BY "checkpoints"."walk_type" DESC, "checkpoints"."number" DESC LIMIT $1  [["LIMIT", 12]]